{"id":1356,"date":"2018-01-05T04:26:33","date_gmt":"2018-01-05T04:26:33","guid":{"rendered":"https:\/\/uoftjn.com\/?p=1356"},"modified":"2018-01-19T21:33:31","modified_gmt":"2018-01-19T21:33:31","slug":"grad-school-101","status":"publish","type":"post","link":"https:\/\/uoftjn.com\/2018\/01\/05\/grad-school-101\/","title":{"rendered":"Grad School 101"},"content":{"rendered":"<p><span style=\"font-weight: 400;\">by Kadachi Yo <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Keita:<br \/>\n<\/span><span style=\"font-size: 14px; letter-spacing: 0px;\">Kadachi, our beloved and respected fourth year student answers all the basic questions for anyone who has considered pursuing further studies.<br \/>\n<\/span><span style=\"font-weight: 400;\">Can you briefly introduce yourself before we start? <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Kadachi:<br \/>\n<\/span><span style=\"font-size: 14px; letter-spacing: 0px;\">Sure thing.<br \/>\n<\/span> <span style=\"font-weight: 400;\">I’m Kadachi Yo (Jiada Ye), a fourth year undergraduate specializing in economics and mathematics at the UofT. Applying master programs and full time RA works, right now. Eventually, I would like to pursue PhD. in economics. My research interests are development economics, economics of education, and microeconomic theory. Speak English, Japanese, and Chinese (Mandarin and Shanghainese). Enjoying playing any types of game, board games, card games, video games, etc&#8230;<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Keita:<br \/>\n<\/span><span style=\"font-size: 14px; letter-spacing: 0px;\">Alrighty, thanks Kadachi!<br \/>\n<\/span><span style=\"font-size: 14px; letter-spacing: 0px;\">Here’s our first question&#8230;<\/span><\/p>\n<p><span style=\"font-weight: 400;\">&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;<\/span><\/p>\n<ol>\n<li><b> What do you need for applying for graduate schools? What are the requirements? Also when do you apply?<\/b><\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">For Master at U of T, you only need two references and good grades, GRE is not required even though it is strongly recommended to submit it. Obviously, you need to have an undergraduate degree. For Master, in general, the deadline is mid-January for UofT and UBC. Master in other countries, like UK, you need more stuff. You need GRE, TOEFL scores, two or three letters from professors, CV, and Statement of Purpose(SOP) or Essay. The deadline is either in December or January. So, if you are considering to apply master program, you should start to prepare from September, or latest October.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">If you want to apply for PhD, it is somehow similar, but slightly different. First, you need transcript, GRE and TOEFL scores. You need to write SOP. Three reference letters. Research paper you wrote before (optional). Most deadline is during December for those top 30-40 schools, so you want to start to prepare from August.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">It is preferable to have economics, math, statistics (or CS, physics) degree for undergraduate or master. Only other programs may be harder to get into master program.<\/span><\/p>\n<ol start=\"2\">\n<li><b> How do you get reference letters from professors? I&#8217;ve never talked to any of them before, but would they accept my request? Even if they do, what and how would they write about me? <\/b><\/li>\n<\/ol>\n<p><span style=\"font-weight: 400;\">There are generally two ways to do so. One way is that you ask professors who taught you in some courses. For this way, you need to put some effort. In general, you really want to do very well (at least top 5~10% in class, or above 95). Usually, this is not enough because you also want them to know you well. You can either go to their office hours frequently (almost every week), or ask “good questions” in classes, so they will remember you and your name. This is easier to do so for smaller classes because by the end of semester professor knows everyone in the class and it is easier for you to ask for reference. The other way is getting letters from professors you worked for as a research assistant (RA). This is much easier to do so because professors already know you, and they sort of know that you are going to ask them for reference letters if you work for them. However, the hard part is to being RA. You can either take their courses, and then ask them for RA work (again the topic interests you and professors know you), or email professors directly, and see if they want any RA. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Personally, I would recommend either you take small classes and you do well, or email professors and try to be their RA.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">What they write in the reference letter is dry for most time. Professors write relationship with you, how they know you, how you did in their courses if you took any of their courses, and your research skills.<\/span><\/p>\n<ol start=\"3\">\n<li><b>To go to grad school, you need good grades. But do you think getting a higher GPA with easier course is better than getting mediocre GPA with harder courses? Would this differ if you are serious about academia (i.e. thinking of PhD in the future), or just going to grad school for recruiting? <\/b><\/li>\n<\/ol>\n<p><span style=\"font-weight: 400;\">Having a higher GPA with easier courses is not necessarily better to get into graduate school. For example, if you are from UofT, it is better to take ECO326 than ECO316 (both game theory courses). Getting A+ in ECO326 and getting A+ in ECO316 is huge difference.For this case, getting A- in ECO326 is actually better than getting A in ECO316. Going to any Master courses, if you take at least all main courses (i.e. ECO325, ECO326, ECO375 at UofT), you can take any courses you want. But you want to do as good as possible for those main courses. Also, taking more math courses is plus, for Economics specifically.<\/span><\/p>\n<ol start=\"4\">\n<li><b>What&#8217;s the differences between masters programs in major English-speaking countries, namely US, UK and Canada? (maybe include Australia, Singapore, etc?) Are there differences in lengths of the programs or difficulties to get in? <\/b><\/li>\n<\/ol>\n<p><span style=\"font-weight: 400;\">For Canada and UK (I think), you need a master degree to do PhD, so it is mandatory for people who want to do PhD. Also, they usually prepare you for PhD program, especially you graduate from undergraduates that are not well-known. However, in US, you do not need Master degree to go to PhD, so Master program in US is more likely for job hunting.<\/span><\/p>\n<ol start=\"5\">\n<li><b>Should you choose a school with more prestige, or a specific program that is well-known? Would this answer change depending on PhD vs Job hunting after Masters?<\/b><\/li>\n<\/ol>\n<p><span style=\"font-weight: 400;\">If you are going to grad school for improving your degree to have better odds in recruiting,the more prestigious school you go, the higher chance to get into the better company. (very subjective and biased opinion of mine) However, for PhD, it is a bit different. Among similar ranks, you would like to choose depending on what fields interest you. Depending on schools, the strong fields are different, so you want to choose based on your interest, but usually you apply all of them anyway. Another thing you want to consider is you want to go to middle rank school and become a top students there, or you go to top school and become a middle level student. Even if you go to top school but you are not top student there, professors may not care about you. However, if you go to middle rank school, but you are top student, then many professors care you more. This hugely impacts your replacement after PhD. (e.g. U Michigan vs Harvard)<\/span><\/p>\n<ol start=\"6\">\n<li><b>Do you need to take GRE in any graduate school programs? How important is GRE for admission? More than GPA and references? Also how important are admission essays? Do all countries have them?<\/b><\/li>\n<\/ol>\n<p><span style=\"font-weight: 400;\">If you want to go to grad school for economics, you need to take GRE in general. It doesn’t matter if you go to master or PhD in US or UK. Only exception is that if you want to go to Master at UofT and UBC. For these cases, you do not need to submit it. Personally, GRE should not matter a lot, but for quantitative part, you would like to get at least 90~95 percentile for PhD. I am not sure if this is true, but I have heard that some schools have cutoff for GRE quantitative part. Verbal part should not matter, but it would be plus if you do well, especially for international students. Admission essays aka. Statement of Purpose (SOP) is required for most PhD program, and Master in UK., but not for UofT and UBC. It is not as important as other documents for PhD, but it may be important for master in UK.<\/span><\/p>\n<ol start=\"7\">\n<li><b> Is there a point in doing a specialist program if you are considering Grad school? I heard admission officers in graduate schools are not aware of differences between specialist and majors outside of UofT.<\/b><\/li>\n<\/ol>\n<p><span style=\"font-weight: 400;\">The program does not matter. The courses you took matter. As I mentioned in Q2, taking ECO325, ECO326, ECO375 is important. This means that you can be a competitive candidate for master program if you take those courses even though you do not have eco program.<\/span><\/p>\n<ol start=\"8\">\n<li><b> Is taking more courses than required effective for your admission? To what extent does it depend on which courses taken and grades<\/b><\/li>\n<\/ol>\n<p><span style=\"font-weight: 400;\">Other than ECO courses I mentioned above, taking math is extremely important, especially real analysis (MAT336, MAT337, MAT357). If you are considering doing PhD economics, you should at least take MAT*37 (MAT137, 237, 337) level courses, and preferably taking*57 (MAT157, 257, 357) level courses. Also, taking some statistics courses or computer science courses could help you. This would not directly affect you through admission, but it will be really helpful if you want to RA work. Of course, you would like to get as high as possible for grades, but I think A- should be the bottom line if you are going to take them.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8211;<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Thanks Kadachi for your time! <\/span><\/p>\n","protected":false},"excerpt":{"rendered":"<p>by Kadachi Yo Keita: Kadachi, our beloved and respected fourth year student answers all the basic questions for anyone who has considered pursuing further studies. Can you briefly introduce yourself before we start? Kadachi: Sure thing. I’m Kadachi Yo (Jiada Ye), a fourth year undergraduate specializing in economics and mathematics [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"nf_dc_page":"","_bbp_topic_count":0,"_bbp_reply_count":0,"_bbp_total_topic_count":0,"_bbp_total_reply_count":0,"_bbp_voice_count":0,"_bbp_anonymous_reply_count":0,"_bbp_topic_count_hidden":0,"_bbp_reply_count_hidden":0,"_bbp_forum_subforum_count":0,"om_disable_all_campaigns":false,"jetpack_post_was_ever_published":false,"jetpack_publicize_message":"","jetpack_is_tweetstorm":false,"jetpack_publicize_feature_enabled":true},"categories":[27],"tags":[],"jetpack_publicize_connections":[],"jetpack_featured_media_url":"","jetpack_sharing_enabled":true,"jetpack_shortlink":"https:\/\/wp.me\/p9x8L8-lS","_links":{"self":[{"href":"https:\/\/uoftjn.com\/wp-json\/wp\/v2\/posts\/1356"}],"collection":[{"href":"https:\/\/uoftjn.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/uoftjn.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/uoftjn.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/uoftjn.com\/wp-json\/wp\/v2\/comments?post=1356"}],"version-history":[{"count":0,"href":"https:\/\/uoftjn.com\/wp-json\/wp\/v2\/posts\/1356\/revisions"}],"wp:attachment":[{"href":"https:\/\/uoftjn.com\/wp-json\/wp\/v2\/media?parent=1356"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/uoftjn.com\/wp-json\/wp\/v2\/categories?post=1356"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/uoftjn.com\/wp-json\/wp\/v2\/tags?post=1356"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}