{"id":1681,"date":"2018-03-08T22:27:15","date_gmt":"2018-03-08T22:27:15","guid":{"rendered":"https:\/\/uoftjn.com\/?p=1681"},"modified":"2018-03-12T23:31:18","modified_gmt":"2018-03-12T23:31:18","slug":"psychology-will-help-you-stop-procrastinating","status":"publish","type":"post","link":"https:\/\/uoftjn.com\/2018\/03\/08\/psychology-will-help-you-stop-procrastinating\/","title":{"rendered":"Psychology will help you stop procrastinating"},"content":{"rendered":"<p><span style=\"font-weight: 400;\">Written by Christopher Collick <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Have you ever sat in front of your computer trying to cram all of the course content in your head a few days before the exam because you just don’t have the self control to get yourself to study earlier. At this day and age when facebook is one click away or snapchat is just a tap away, controlling the urge from these distractions and <strong>actually getting your work done may be one of the toughest experiences we face<\/strong>. For those of us that have horrible planning skills and likes to procrastinate a lot, it is due to problems stemming from bad toilet training we received as kids. Or at least that is what a major psychological theorist Sigmund Freud once thought. However recent studies in psychology shows that perhaps there is a more clear reasoning behind why we procrastinate. Psychologists have shifted their focus of procrastination from inner ideas to a <strong>more goal-oriented dynamic approach<\/strong>.<br \/>\nThe big connection we need to make is between intention and action while filtering out distractions that come in our ways.<\/span><\/p>\n<p><img decoding=\"async\" loading=\"lazy\" class=\"size-medium wp-image-1686 aligncenter\" src=\"https:\/\/i0.wp.com\/uoftjn.com\/wp-content\/uploads\/2018\/03\/giphy-300x168.gif?resize=300%2C168&#038;ssl=1\" alt=\"\" width=\"300\" height=\"168\" data-recalc-dims=\"1\" \/><\/p>\n<p><span style=\"font-weight: 400;\">Studies of procrastination have been seen dating back as far back as 800B.C., when a Greek poet Hesiod stated that we must be cautious not to “put back your work till tomorrow and the day after”. Since then the study of procrastination has advanced and perhaps the level of procrastination with it due to technological advances.<br \/>\nOne of the first studies to record the detrimental nature of procrastination was published in Psychological Science back in 1997.<br \/>\nA psychologist named Roy Baumeister conducted a research on college students and measured their procrastination level, academic performance and health. He found that initially the students had lowered level of stress due to them putting away work and doing things they enjoy. However<strong> in the long run the procrastinators got lower grades than the controlled group and in addition they showed higher cumulative amounts of stress and illness<\/strong>.<br \/>\nThe effect of procrastination not only affects our academic lives but also our own well-being. Thus it is important for us to prevent procrastination and drive ourselves to be determined to work.<br \/>\n<\/span><\/p>\n<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">To overcome our habits of procrastinating it is important to note why most of us end up procrastinating. There our <strong>four main reasons<\/strong> that psychologists believe are reasons why we procrastinate.<\/span><\/p>\n<p>The most significant predictor of procrastination is<strong> how unpleasant or troublesome a task<\/strong> is. If the task is undesirable for you, clearly most people would try and avoid it or postpone it for later. Ardeou and White found that dividing your main goal to various components of easy tasks and spending 40 to 60 minutes interval on each would help overcome issues such as this.<\/p>\n<p>Another important component for procrastination is <strong>timing of our reward and punishment<\/strong>. This better explained is the <strong>time difference between the point at which we make a choice and the associated consequences<\/strong>. Procrastination takes place when current efforts are more noticeable compared to the future ones, leading us to postpone tasks without anticipating that when it comes time to do them, the required action will be postponed yet again. For example, a smoker who wants to quit could have their so called “last cigarette” for many years. The way to overcome this is to make long term goals feel like short term goals to give yourself the sense of achievement. For the cigarette example this would be like going through a week without a cigarette and then rewarding yourself for it once and then cutting down on them until you need none in the future.<\/p>\n<p><img decoding=\"async\" loading=\"lazy\" class=\"size-medium wp-image-1689 aligncenter\" src=\"https:\/\/i0.wp.com\/uoftjn.com\/wp-content\/uploads\/2018\/03\/4ac9db7439-300x156.png?resize=300%2C156&#038;ssl=1\" alt=\"\" width=\"300\" height=\"156\" data-recalc-dims=\"1\" \/><\/p>\n<p>Another factor causing us to procrastinate may be <strong>anxiety<\/strong>. Due to the fear of failing we may postpone when to actually do the task so that we do not need to feel anxiety. To relieve or avoid stress procrastinators shift their priority from long term goals to more immediate reward giving experiences in order to avoid high priority yet challenging tasks.<\/p>\n<p><span style=\"font-weight: 400;\">Finally the most important aspect as to why we procrastinate is the <strong>absence of structure<\/strong>. The lack of imposed direction and motivation has become the most common and yet detrimental reason as to why we procrastinate. <\/span><span style=\"font-weight: 400;\">The collapse of the delay between impulse and decision inevitably favors impulses such as facebook or snapchat and other distraction. One solution to this is to design your environment in a way that makes your desired goal more likely to happen and to have a goal-oriented approach towards work and academics. The key here is motivation. To be motivated to achieve an underlying goal would help us realize that procrastination will only get in our way and thus it is important for all of us to find an idea or epiphanic source to strive for more. Perhaps the best place to start may be the UTJN website where we can view other people in UofT and what stimulates them and drives them to be better, in effect causing us to realize that we too can strive for more and have a goal that we aim for. <\/span><\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Written by Christopher Collick Have you ever sat in front of your computer trying to cram all of the course content in your head a few days before the exam because you just don’t have the self control to get yourself to study earlier. At this day and age when [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"nf_dc_page":"","_bbp_topic_count":0,"_bbp_reply_count":0,"_bbp_total_topic_count":0,"_bbp_total_reply_count":0,"_bbp_voice_count":0,"_bbp_anonymous_reply_count":0,"_bbp_topic_count_hidden":0,"_bbp_reply_count_hidden":0,"_bbp_forum_subforum_count":0,"om_disable_all_campaigns":false,"jetpack_post_was_ever_published":false,"jetpack_publicize_message":"","jetpack_is_tweetstorm":false,"jetpack_publicize_feature_enabled":true},"categories":[62,32],"tags":[],"jetpack_publicize_connections":[],"jetpack_featured_media_url":"","jetpack_sharing_enabled":true,"jetpack_shortlink":"https:\/\/wp.me\/p9x8L8-r7","_links":{"self":[{"href":"https:\/\/uoftjn.com\/wp-json\/wp\/v2\/posts\/1681"}],"collection":[{"href":"https:\/\/uoftjn.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/uoftjn.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/uoftjn.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/uoftjn.com\/wp-json\/wp\/v2\/comments?post=1681"}],"version-history":[{"count":0,"href":"https:\/\/uoftjn.com\/wp-json\/wp\/v2\/posts\/1681\/revisions"}],"wp:attachment":[{"href":"https:\/\/uoftjn.com\/wp-json\/wp\/v2\/media?parent=1681"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/uoftjn.com\/wp-json\/wp\/v2\/categories?post=1681"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/uoftjn.com\/wp-json\/wp\/v2\/tags?post=1681"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}