{"id":2825,"date":"2019-06-04T18:56:06","date_gmt":"2019-06-04T22:56:06","guid":{"rendered":"https:\/\/uoftjn.com\/?p=2825"},"modified":"2019-06-13T16:01:28","modified_gmt":"2019-06-13T20:01:28","slug":"%e3%83%88%e3%83%ad%e3%83%b3%e3%83%88%e5%a4%a7%e7%94%9f%ef%bd%9ebcf%e4%bd%93%e9%a8%93%e8%a8%98%ef%bd%9e","status":"publish","type":"post","link":"https:\/\/uoftjn.com\/2019\/06\/04\/%e3%83%88%e3%83%ad%e3%83%b3%e3%83%88%e5%a4%a7%e7%94%9f%ef%bd%9ebcf%e4%bd%93%e9%a8%93%e8%a8%98%ef%bd%9e\/","title":{"rendered":"トロント大生～BCF体験記～"},"content":{"rendered":"<p>Edited by the Torontonians team<\/p>\n<p>日英バイリンガルや日本で就職したい海外大生が集うイベント、ボストンキャリアフォーラム、略してボスキャリまたはBCF。2018は11月9日～11月11日の三日間に渡って行われ、数々の企業が参加しました。特に3、4年生にとってはインターンシップや新卒採用をもらうのにうってつけの大イベントです。そこで、まだ行ったことが無い学生達（特に1、2年生）のために当日のスケジュールや事前準備等について昨年参加した先輩方に答えていただきました。<br \/>\n忙しい時期の中質問に答えて頂いたEmilyさん、Shioriさん、Avkashさん、Hinakoさん、Takumiさん、ありがとうございました！<\/p>\n<p>For those who are English-Japanese bilinguals or are searching for a job in Japan, <strong><em>Boston Career Forum (BCF) <\/em><\/strong>is the event for you, especially 3rd and 4th year students who are seeking for internships or full-time offers. Last year&#8217;s event ran from November 9th to November 11th, collecting a large number of diverse companies from Japan. We have asked our fellow UofT students from different backgrounds regarding the preparation leading up to the event (and more).<br \/>\nBefore we begin, we&#8217;d like to thank Emily, Shiori, Avkash, Hinako, and Takumi for taking your time to answer these questions during busy times!<\/p>\n<h5><strong><u>Emily Chen<\/u><\/strong><\/h5>\n<p>4年生　政治学・トランスナショナルスタディーズの二重専攻<br \/>\n果物と新しい言語を学ぶことが好きな台湾系カナダ人。<\/p>\n<p><span style=\"font-weight: 200;\">4th year, Double Major in Political Science and Diaspora and Transnational Studies.<br \/>\n<\/span><span style=\"font-weight: 200;\">I am a Canadian-Taiwanese that loves fruits and has a passion for learning languages.<br \/>\n<\/span><\/p>\n<span class=\"collapseomatic \" id=\"id63803b4a47ac4\"  tabindex=\"0\" title=\"Q&amp;A\"    >Q&amp;A<\/span><div id=\"target-id63803b4a47ac4\" class=\"collapseomatic_content \">\n<p><strong>1.どうしてBCFに行こうと決めたんですか？ Why did you decide to go to BCF?<\/strong><\/p>\n<p>シンプルに、日本で働きたかったからです。<br \/>\n日本を拠点にすればアジアンビジネスの急成長を間近で見ると同時にそれに貢献し、スキルアップに繋がると思いました。<br \/>\n特に外国人として、価値や文化、言語が違う中で成功するためには企業のアイデンティティ、文化、働く環境などを深く考慮するべきだと考えています。<br \/>\n<span style=\"font-weight: 400;\">Simple, I wanted to work in Japan.<br \/>\n<\/span><span style=\"font-weight: 400;\">More specifically, situating myself in Japan would allow me to get a closer look at the fast-growing Asian business climate, whilst developing the skills and expertise to contribute to it.<br \/>\n<span style=\"font-weight: 200;\">As a non-Japanese individual, I think it is extremely important to consider corporate identity and environment &#8211; to ensure that you land yourself a job which allows you to thrive despite any differences in values, ethics or language.  <\/span><\/span><\/p>\n<p><strong>2.どの分野に興味がありましたか？ What kind of job\/internship areas where you looking for?<\/strong><\/p>\n<p><span style=\"font-weight: 400;\">自分の今学んでいることがどの業界にも当てはまらないと感じたため、基本的に分野は絞らず視野を広く保ちました。<br \/>\n<\/span><span style=\"font-weight: 400;\">その中でも特にコンサルティングに興味がありましたが、内容によっては総合職にも興味がありました。<br \/>\nI was generally open-minded about the job areas, as I didn’t feel like my studies at UofT translated to any particular field\/industry. I was particularly interested in consulting, but was also attracted to a few general positions (総合職) depending on the job description.<\/span><\/p>\n<p><strong>3.BCFに行く前の準備としてはどんなことをしましたか？　What did you do before going to BCF in terms of preparation?<\/strong><\/p>\n<p>BCFに参加するにあたってトロント大学にある機会を有効活用し、準備をすることは必須です。企業セミナーに積極的に参加することでどの様な人材を求めているかがわかります。キャリアネットワークは皆が成功するためにあるので、情報集めのために色んな方々に働きかけるべきです。<br \/>\n個人的には、自己分析と面接の練習をかなりしました。面接突破の鍵は自分がBCFで何を求めているのか、何を提示できるのかを理解することが重要です。<br \/>\n一番苦労したことは日本語で流暢に対応するための練習です。手伝ってくれた友達には感謝でいっぱいです。<br \/>\n<span style=\"font-size: 14px; letter-spacing: 0px;\">It is absolutely imperative that you prepare for the BCF, and take advantage of the increasing opportunities offered at U of T. For example, attending information sessions allows you to better understand corporate expectations. Do not be afraid to reach out to individuals for resources, as career networks exist to help you succeed.<br \/>\n<\/span><span style=\"font-size: 14px; letter-spacing: 0px;\">On a personal note, I had to do a fair amount of self-reflection and speaking practice. Knowing what you want to achieve from BCF as well as understanding what you have to offer is key to a successful interview. Also, it was a challenging process to articulate everything perfectly in Japanese, and I still owe a few friends a free meal for their help.<\/span><\/p>\n<p><strong>4.会場に着いた時の率直な感想は？ What was your impression upon arriving at the BCF venue?<\/strong><\/p>\n<p>会場に着いたときはあっけにとられました。全てが整然としていて、他の就活生達の気迫が伝わってきました。<br \/>\n<span style=\"font-weight: 400;\">Upon arriving at the BCF venue, I was pretty amazed at first. It’s always reassuring when the career forum and the participants themselves are extremely well-organized, and you could feel how focused everybody was.<\/span><\/p>\n<p><strong>5.ざっくりとBCF中のスケジュールを教えられる範囲でお願いします。A simple overview of your schedule during BCF.<\/strong><\/p>\n<p><span style=\"font-weight: 400;\">私の殆どの面接は金曜日にあり、通過したときは、追加面接が土曜日と日曜日にも行われました。これらは近くのホテルで開かれ、自分の能力を測る試験（プレゼン、ロールプレイ等）も含みました。<br \/>\nMost of my interviews took place on Friday, and upon receiving positive responses I also attended additional rounds of interviews which continued onto Saturday and Sunday morning. This also included having to go to an assessment centre which took place at a nearby hotel, which evaluated your capabilities (e.g. sales presentation, role-play).<\/span><\/p>\n<p><strong>6.あなたの思うBCFに参加することの利点。Your thoughts on the benefits of going to BCF.<\/strong><\/p>\n<p>BCFの利点は就活へのヘッドスタートができることです。BCFのプロセスはシンプル且つハッキリしているので時間と努力を無駄にするような事はありません。たとえ狙っていたインターンシップや仕事が貰えなかったとしても貴重な経験になります。<br \/>\n<span style=\"font-weight: 400;\">I think the key benefit is that the BCF enables you to get a headstart in the job-hunting process, and even if it doesn’t help secure your desired job or internship, you have gained valuable experience at the very least. I also appreciate how the BCF process is straightforward and decisive, so as to not waste any of your time or effort.<\/span><\/p>\n<p><strong>7. 1、2年生やまだ参加したことが無い人たちへのアドバイスはありますか？ Any advice for 1st and 2nd years or any others who did not attend the event?<\/strong><\/p>\n<p><span style=\"font-size: 14px; letter-spacing: 0px;\">BCFの空気に圧倒されてしまうかもしれないけれど、平常心を保って自分のペースで行く事。他の就活生達に競り負けるのを恐れるよりも自分のベストを尽くすことに集中するべきです。<br \/>\n正直BCFでインターンシップや内定を急ぐ必要はないと思います。最終的には自分の中での決断が必要だし、自分が何を求めているのかが定まっていないのであれば、無理して行かなくてもいいと思います。<br \/>\nI think the BCF atmosphere can be quite daunting, but it is important to stay calm, and go at your own pace. Instead of being scared about losing to fellow competition, it is better to be focused on delivering the best performance you can possibly give.<br \/>\n<\/span><span style=\"font-size: 14px; letter-spacing: 0px;\">To be honest, I do not consider it necessary to rush yourself in order to secure an internship\/job opportunity at Boston, because attending the BCF ultimately requires a lot of decisiveness on your part. If you are still unsure as to what you want to achieve at BCF, I do not think you should feel pressured to go.<\/span><\/p>\n<\/div>\n<h5><strong><u>Shiori Sato(佐藤栞)<\/u><\/strong><\/h5>\n<p>4年生　脳神経科学・生物・生態学<br \/>\nシンガポール生まれシンガポール育ち。<br \/>\n日本には長期間住んだことはなく（長くて４ヶ月）、日本人の両親の元、家では日本語、学校では英語という環境で育った。 UWCSEAでIB取得後、トロント大学に進学。 幼い頃は 目が不自由な方の世界観を変える盲導犬に魅了され、医者になりたいと思い、大学では脳神経化学・生物を専攻することが夢であった。<\/p>\n<p>4th year, Double Major in Neuroscience and Biology\/Ecology.<br \/>\nBorn and raised in Singapore.<br \/>\nHave not lived in Japan for more than 4 months; however, both parents are Japanese and was raised in an environment speaking Japanese at home, English at school. Entered the University of Toronto upon obtaining the IB diploma at UWCSEA. Dreamed to learn Neuroscience\/Biology to become a doctor from a young age after seeing guide dogs help blind people change their world.<\/p>\n<span class=\"collapseomatic \" id=\"id63803b4a47b0a\"  tabindex=\"0\" title=\"Q&amp;A\"    >Q&amp;A<\/span><div id=\"target-id63803b4a47b0a\" class=\"collapseomatic_content \">\n<p><strong>1.どうしてBCFに行こうと決めたんですか？ Why did you decide to go to BCF?<\/strong><\/p>\n<p>大学院ではなく、世の中に出て見て知りたいという気持ちから就活を始めました。就活は３年生から始めて、コンサル・商社を主に見ていましたが、インターン後に心が変わって金融に興味を持ち、まだ挑戦していなかった金融やメーカーに応募するためBCFに行きました。割と好奇心旺盛な性格なので、自分の選択肢を広げたいという思いがありました。<br \/>\nI became interested in exploring the society instead of directly moving on to graduate school. My job seeking began in 3rd year, mainly focusing on consulting firms and trading companies. After my internship, my interest shifted towards financing, so I went to the BCF to challenge new fields including financial companies and makers. I am also inquisitive so I wanted to expand my options.<\/p>\n<p><strong>2.どの分野に興味がありましたか？ What kind of job\/internship areas where you looking for?<\/strong><\/p>\n<p>外資系金融機関、外資系一般消費財メーカー、外資系戦略コンサル、フルタイム、東京オフィス。<br \/>\nForeign-owned financial institutions, Foreign-owned general consumer goods makers, Foreign-owned strategic consulting firms, Full-time job, Tokyo office.<\/p>\n<p><strong>3.BCFに行く前の準備としてはどんなことをしましたか？　What did you do before going to BCF in terms of preparation?<\/strong><\/p>\n<p>課外活動：インターンシップ・学生団体、自己分析、先輩からのアドバイス、企業分析。<br \/>\n<span style=\"font-size: 14px; letter-spacing: 0px;\">Extracurricular activities: Internship, Student organisation, Self reflection, Advice from upper years, Corporate analysis.<\/span><\/p>\n<p><strong>4.会場に着いた時の率直な感想は？ What was your impression upon arriving at the BCF venue?<\/strong><\/p>\n<p>人が多い。<br \/>\nA lot of people.<\/p>\n<p><strong>5.ざっくりとBCF中のスケジュールを教えられる範囲でお願いします。A simple overview of your schedule during BCF.<\/strong><\/p>\n<p><u>金曜日(Friday)<\/u><br \/>\n6:15　起床 Wake up<br \/>\n7:30 出発 Leave airbnb<br \/>\n8:00 朝食 Breakfast<br \/>\n8:15 会場に到着　Arrive at the venue<br \/>\n9:00 イベント開始　Event start<br \/>\n9:00-9:30　レジュメを3社に配る Resume Drop off to 3 firms<br \/>\n9:45-10:30 企業A一次面接　Company A First Round<br \/>\n10:30 企業Bと電話　Company B phone call<br \/>\n11:00 企業Cと電話 Company C phone call<br \/>\n11:15-11:45　企業D二次面接　Company D Second Round<br \/>\n12:00-13:00 企業C一次面接　Company C First Round<br \/>\n13:00-14:00 企業C二から五次面接　Company C Second up to Fifth Round<br \/>\n14:00-15:00 企業E二次面接　Company E Second Round<br \/>\n15:00-15:30　企業Cからのオファー・ディナーの招待　Company C Offer\/Invitation to dinner<br \/>\n15:30-17:00 準備　Prep<br \/>\n17:00-18:00 企業B一次面接　Company B First Round<br \/>\n18:30-24:00 企業Cディナー　Company C Dinner<\/p>\n<p><strong>6.あなたの思うBCFに参加することの利点。Your thoughts on the benefits of going to BCF.<\/strong><\/p>\n<p>有名企業が一箇所に集まっているから、時間が空いているときには話に行けます。何が起きるかわからないから楽しいし、色々な人に会えます。<br \/>\n自分のこと、将来のこと、いろいろ考えさせられます。<br \/>\nIt is fun because what happens is unpredictable and you can meet various people.<br \/>\nFamous companies all collect into one place, so you can go chat with representatives when you have some time.<br \/>\nIt makes you think about a lot of things, including yourself and your future.<\/p>\n<p><strong>7. 1、2年生やまだ参加したことが無い人たちへのアドバイスはありますか？ Any advice for 1st and 2nd years or any others who did not attend the event?<\/strong><\/p>\n<p>大学卒業まで２年・３年あると働くという概念があまり無いと思うし、１・２年生が応募できるポジションも少ないと思うので、ボストンまで行く必要はないと思います。３年生になって本格的に就活を始め、内定を狙いつつBCFを体感することはおすすめです！<br \/>\nIn your first two years of university, the idea of working is probably not familiar and on top of that, the positions that first and second years can apply are limited, so you don&#8217;t HAVE to go to BCF. It is recommended that you experience what BCF is like(while aiming for offers) once you become a third year and you shift your gears towards job hunting!<\/p>\n<\/div>\n<h5><strong><u>Avkash Mukhi<\/u><\/strong><\/h5>\n<p>3年生、生産工学専攻、横浜で生まれ育った。<\/p>\n<p><span style=\"font-weight: 400;\">3rd year, Industrial Engineering, born and raised in Yokohama.<\/span><\/p>\n<span class=\"collapseomatic \" id=\"id63803b4a47b2e\"  tabindex=\"0\" title=\"Q&amp;A\"    >Q&amp;A<\/span><div id=\"target-id63803b4a47b2e\" class=\"collapseomatic_content \">\n<p><strong>1.どうしてBCFに行こうと決めたんですか？ Why did you decide to go to BCF?<\/strong><\/p>\n<p>来夏のインターンシップを探すためと、どんな仕事が自分の性格とスキルに合うかを知るためです。<strong><br \/>\n<\/strong><span style=\"font-weight: 400;\">To find an internship for next summer and to try and figure out what kind of work interests me\/fits my personality and skill set.<\/span><\/p>\n<p><strong>2.どの分野に興味がありましたか？ What kind of job\/internship areas where you looking for?<\/strong><\/p>\n<p><span style=\"font-weight: 400;\">技術、コンサル、金融。<br \/>\nTechnology, consulting, and finance.<\/span><\/p>\n<p><strong>3.BCFに行く前の準備としてはどんなことをしましたか？　What did you do before going to BCF in terms of preparation?<\/strong><\/p>\n<p><span style=\"font-weight: 400;\">9月上旬にインターンシップに応募をし始め、BCFまでの7週間は週3回程のインタビューを受けていました。<br \/>\n<\/span><span style=\"font-size: 14px; letter-spacing: 0px;\">I started applying for internship positions in the beginning of September, and had around 3 interviews per week in the 7 weeks leading up to the BCF.<\/span><\/p>\n<p><strong>4.会場に着いた時の率直な感想は？ What was your impression upon arriving at the BCF venue?<\/strong><\/p>\n<p><span style=\"font-weight: 400;\">こんなに黒スーツを目の当たりにしたのは初めて。<br \/>\nI’ve never seen so many black suits in my life.<\/span><\/p>\n<p><strong>5.ざっくりとBCF中のスケジュールを教えられる範囲でお願いします。A simple overview of your schedule during BCF.<\/strong><\/p>\n<p>木曜：面接2つとディナーと飲み。<br \/>\n<span style=\"font-weight: 400;\">金曜：面接6つ、幾つかの会話とディナー。<br \/>\n<\/span><span style=\"font-weight: 400;\">土曜：幾つかの会話とディナー。<br \/>\n日曜：最終的な話し合い。<br \/>\nThursday: Two interviews followed by a dinner and drinks.<br \/>\nFriday: Six interviews, several chats, followed by a dinner.<br \/>\nSaturday: Several chats followed by a dinner.<br \/>\nSunday: Final chats.<\/span><\/p>\n<p><strong>6.あなたの思うBCFに参加することの利点。Your thoughts on the benefits of going to BCF.<\/strong><\/p>\n<p><span style=\"font-weight: 400;\">BCFへの準備は面接練習という面で非常に役に立ちました。一つ一つの面接ごとに慣れて上手くなるし、様々な方と話すことで自分が本当に就きたい仕事、そして働きたい人たちが明確になってい<\/span><span style=\"font-weight: 400;\">きます。<br \/>\nPreparing for the BCF was great in terms of letting me practice interviewing. I think you get better with each interview, and the more people you talk to the more you realize what kind of work you want to do, and what kinds of people you want to be working alongside.<\/span><\/p>\n<p><strong>7. 1、2年生やまだ参加したことが無い人たちへのアドバイスはありますか？ Any advice for 1st and 2nd years or any others who did not attend the event?<\/strong><\/p>\n<p><span style=\"font-weight: 400;\">皆が皆BCFに向いているわけではないけれど（全く興味がない人もいるかも知れない）、面接スキルと職業上の話し方が見につきます。一、二年生達は本イベントに行く必要はないと思うけれど、キャンパス内の企業説明会等には世の中にどんな企業や仕事があるかを知るためにも足を運ぶべきです。<br \/>\n1st and 2nd years, don’t bother going to the actual event but do attend as many of the on campus career recruitment events as possible just to learn about what kinds of jobs and companies are out there. The BCF isn’t for everyone (attending companies may not interest you at all) but it is still a great way to learn how to interview and talk to people in a professional setting.<\/span><\/p>\n<\/div>\n<h5><strong><u>Hinako Fujiwara(藤原妃奈子)<\/u><\/strong><\/h5>\n<p>3年生、スペイン語とラテンアメリカ学の二重専攻。<\/p>\n<p><span style=\"font-weight: 400;\">3rd year, Double Major in Spanish and Latin American Studies<\/span><\/p>\n<span class=\"collapseomatic \" id=\"id63803b4a47b4d\"  tabindex=\"0\" title=\"Q&amp;A\"    >Q&amp;A<\/span><div id=\"target-id63803b4a47b4d\" class=\"collapseomatic_content \">\n<p><strong>1.どうしてBCFに行こうと決めたんですか？ Why did you decide to go to BCF?<\/strong><\/p>\n<p><span style=\"font-weight: 400;\">すでにいくつかのインタビューが決まっていたからです。<br \/>\nHad a few interviews scheduled.<\/span><\/p>\n<p><strong>2.どの分野に興味がありましたか？ What kind of job\/internship areas where you looking for?<\/strong><\/p>\n<p><span style=\"font-weight: 400;\">新卒採用は商社。インターンシップに関しては特に絞っていませんでした。既にインタビューが決まっていた企業に関しては、分野というより、企業別でみていました。<br \/>\nTrading companies but not anything in particular for internships. Though rather than areas, I was looking more into individual companies (for which I had interviews).<\/span><\/p>\n<p><strong>3.BCFに行く前の準備としてはどんなことをしましたか？　What did you do before going to BCF in terms of preparation?<\/strong><\/p>\n<p>キャンパス内の企業説明会に参加。BCFに参加する企業の中から興味のあるものに応募をしました。<br \/>\n<span style=\"font-weight: 400;\">Attended on-campus recruiting events.<br \/>\nLooked up which companies were coming and applied to a few that I was interested in.<\/span><\/p>\n<p><strong>4.会場に着いた時の率直な感想は？ What was your impression upon arriving at the BCF venue?<\/strong><\/p>\n<p><span style=\"font-weight: 400;\">「人が多い！」<br \/>\n正直、一ヶ所に（しかもボストンに）あんなに日本人が集まっていたのが妙に感じました。<br \/>\n現地に住んでいる人達がスーツ姿の日本人集団を見てどう思ったのか想像もできません！<br \/>\nI thought, “Wow, that’s a lot of people.” And frankly, seeing that many Japanese concentrated in one place (AND in Boston) was quite peculiar. I couldn’t help but imagine what the local people thought seeing so many Japanese people at once, all donning suits!<\/span><\/p>\n<p><strong>5.ざっくりとBCF中のスケジュールを教えられる範囲でお願いします。A simple overview of your schedule during BCF.<\/strong><\/p>\n<p><span style=\"font-weight: 400;\">金曜：ブースに足を運んだ。企業との面接とディナー。<br \/>\n土曜：参加していない。<br \/>\n日曜：面接。<br \/>\nFriday: Visited booths, had an interview and a dinner with a company.<br \/>\n<\/span><span style=\"font-weight: 400;\">Saturday: Didn’t attend.<br \/>\nSunday: Had an interview.<\/span><\/p>\n<p><strong>6.あなたの思うBCFに参加することの利点。Your thoughts on the benefits of going to BCF.<\/strong><\/p>\n<p><span style=\"font-weight: 400;\">色んな企業の人事の方たちと話すにはもってこいの場です。こんなにも有名企業が一ヶ所に集まる機会はなかなかありません。<br \/>\nIt’s a great place to talk to \/ get to know the HR of so many companies at once. You don’t get too many opportunities where so many big names come together in one place.<\/span><\/p>\n<p><strong>7. 1、2年生やまだ参加したことが無い人たちへのアドバイスはありますか？ Any advice for 1st and 2nd years or any others who did not attend the event?<\/strong><\/p>\n<p>個人的には、BCFで起こる事はあなた次第なので、頭の中に明確なゴールを入れておくことが重要だと思います。それが内定をもらうことなのか、インターンシップをもらうことなのか、はたまたそこにある選択肢を見てみたいだけなのか。きちんと目的に添った準備をしていけば追い求めていたものが手に入るはずです！そこで見て歩き回るだけでもいいんです。ただ、周りにいるたくさんの面接を受ける人達に流されないでください。ペースの速いイベントなので、「行ってみればなんとかなる」という精神だと、結果に落ち込んでしまうかもしれません。<br \/>\n<span style=\"font-weight: 400;\">I feel like BCF is whatever you make it to be, so it’s important to have a goal in mind when going. Whether it’s getting a full-time offer, getting an internship position or just taking a look at what opportunities there are available to you, prepare and set your expectations accordingly and you will (hopefully!) get what you were looking for. Even if you’re there browsing, that’s fine. Just don’t let other people who have a bunch of interviews scheduled influence or pressure you. On the other hand, if you attend the event thinking “I’ll just go and see what happens,” chances are you will be disappointed by the outcome, especially because it’s a very high-paced event!<\/span><\/p>\n<\/div>\n<h5><strong><span style=\"text-decoration: underline;\">Takumi Yamuchi<\/span><\/strong><\/h5>\n<p>3年生、Rotman Commerce ファイナンスと経済学専攻。<br \/>\nミラノ、ミュンヘン、ニュージャージー、神戸を含む色んな都市で育った。アルペンスキーの試合に出場した他に、スタートアップ企業の共同設立に関わったり、トロント市内をセールスマンとして駆け回ったりと様々な経験を積んでいる。この様な経験もあって、興味はスポーツから芸術批評まで幅広い。（何か聞きたいことがあればご連絡ください！とのことです。）<\/p>\n<p>3rd year, Rotman Commerce Finance &amp; Economics Specialist.<br \/>\n<span style=\"font-weight: 400;\">I grew up in several places including Milan, Munich, New Jersey, and Kobe and have experienced many activities such as competing nationally in alpine skiing, co-founding a startup, and running around Toronto as a salesman. These experiences have developed my interests across the spectrum starting with sports on one side and critiquing art on the other hand. Feel free to talk to me about anything!<\/span><\/p>\n<span class=\"collapseomatic \" id=\"id63803b4a47b72\"  tabindex=\"0\" title=\"Q&amp;A\"    >Q&amp;A<\/span><div id=\"target-id63803b4a47b72\" class=\"collapseomatic_content \">\n<p><strong>1.どうしてBCFに行こうと決めたんですか？ Why did you decide to go to BCF?<\/strong><\/p>\n<p><strong><span style=\"font-weight: 400;\">就職活動半分、興味半分。BCFに行こうと思ったきっかけは自分のキャリアでどこまで行けるのかを知りたかったからです。230社もの企業が参加するBCFなら自分が働きたいと思える企業に出会えるだろうと思いました。それだけでなく、プロフェッショナルな会話とインタビューを受けることがいずれ自分の役に立つと確信していました。<br \/>\n<\/span><br \/>\n<span style=\"font-weight: 400;\">Half for job hunting, half of interest. I decided to attend BCF because I wanted to learn more about where I can go with my career. I figured 230 companies attend BCF so I would eventually come across a firm that I hope to work in. Apart from that, I knew getting practice to speak in a professional setting and interviewing would be a valuable experience I can take advantage of.<\/span><\/strong><\/p>\n<p><strong>2.どの分野に興味がありましたか？ What kind of job\/internship areas where you looking for?<\/strong><\/p>\n<p>興味は様々ですが、第一志望は金融でした。特に投資銀行、エクイティーリサーチ、プライベートエクイティ。他にも候補としては戦略コンサルティングとスタートアップ。正直、自分の業務に価値と意味がある仕事を探していました。<br \/>\n<span style=\"font-weight: 400;\">I have various interests but my number one choice would be finance, especially in areas of investment banking, equity research, and private equity. Other areas that I consider are strategic consulting, startups, and honestly anywhere that I feel like my work matters.<\/span><\/p>\n<p><strong>3.BCFに行く前の準備としてはどんなことをしましたか？　What did you do before going to BCF in terms of preparation?<\/strong><\/p>\n<p>BCF前にはさほど準備していなかったので、その重要性を痛感しました。<br \/>\n課題を与えられたことがあったのでそれは勿論ですが、興味があった企業のリサーチも行ってインタビュー当日のためのプレゼンの準備をしていました。<br \/>\n<span style=\"font-weight: 400;\">I didn’t prepare a lot prior to BCF which is one thing that I take away from the whole experience. I did some background research for many of the companies that I was interested in. In some cases, I was given a take-home case to be presented on the day of the interview so I had to work on them.<\/span><\/p>\n<p><strong>4.会場に着いた時の率直な感想は？ What was your impression upon arriving at the BCF venue?<\/strong><\/p>\n<p><strong><span style=\"font-weight: 400;\">想像以上にスケールが大きかったです。<br \/>\nIt was so much bigger and at a larger scale than I expected.<\/span><\/strong><\/p>\n<p><strong>5.ざっくりとBCF中のスケジュールを教えられる範囲でお願いします。A simple overview of your schedule during BCF.<\/strong><\/p>\n<p><span style=\"font-size: 14px; letter-spacing: 0px;\">本イベントは金土日の三日間（9時～18時）に渡りました。私の場合、初日はイベント前に予め応募していた企業との面接が朝から昼過ぎまでありました。残りの午後は興味があった他の企業の説明会やウォークイン面接に<\/span><span style=\"font-size: 14px; letter-spacing: 0px;\">参加しました。二日目と三日目は、事前にインタビューがセットアップされていなかったこと以外前日とさほど差はありませんでした。空いた時間には履歴書を渡していた企業からの面接を受けたり、ブースを歩き回ったりしました。夜は企業から招待して頂いたディナーが10時頃までありました。<br \/>\nThe event is for 3 days on Friday, Saturday, Sunday from around 9 AM to 6 PM. I had two types of days. On my first day, I had interviews already set up from companies I applied to prior to BCF throughout the morning and early afternoon. For the rest of the afternoon, I wandered around the booth area where companies do information sessions and walk-in interviews to look for any other companies that I was interested in. The second and third day was pretty similar besides not having prior interviews set. I decided to roam around more and check out more companies while attending interviews for companies that responded after dropping off my resume on the spot. At night I had companies invite me to a dinner which usually ends around 10 PM.<\/span><\/p>\n<p><strong>6.あなたの思うBCFに参加することの利点。Your thoughts on the benefits of going to BCF.<\/strong><\/p>\n<p>二、三年生にとってはどんな企業があり、自分がどの道に進みたいのかを知ることができる経験だと思います。知りもしなかった企業を見つけたり、導いてくれる人に出会えたりします。それに、面接の練習が出来て、インターンシップももらえるので、良いことずくめです。<\/p>\n<p><strong><span style=\"font-weight: 400;\">For 2nd, 3rd years I think it&#8217;s a great experience to see what kind of companies are out there and thinking more about career paths. You always find out about companies you never even knew existed and meet people that can guide you. Besides that the experience to interview for actual companies and land internships is incredible. <\/span><\/strong><\/p>\n<p><strong>7. 1、2年生やまだ参加したことが無い人たちへのアドバイスはありますか？ Any advice for 1st and 2nd years or any others who did not attend the event?<\/strong><\/p>\n<p>多くの学生にとって就活はまだ先の様に感じるかも知れませんが、BCFに行くことで就活がより現実味を帯びてきました。一、二年生達は就職するプレッシャーはまだないので、興味のある分野を開拓できる良い経験になります。準備をすることが鍵です！<strong><br \/>\n<\/strong><span style=\"font-weight: 400;\">For students in their 1st and 2nd year, there is no pressure to land a job so I think it is a great way to start thinking about potential career paths. For many students, the idea of getting a job and employment may seem distant, and for me, BCF definitely bridged that gap to a large extent.  Preparation is key!<\/span><\/p>\n<\/div>\n<hr \/>\n<h4>最後に \/ To Conclude<\/h4>\n<p>この記事を読んだ皆さんには、いい意味で焦ってもらえればと思います。トロント大学には長期間の夏休みがあるので、是非その時間を有効活用してもらいたいと思います。先輩方の経験をもとに、じっくりと自分のやりたいことや出来る事を見つめ直してみてください！<br \/>\nI&#8217;d like the readers to feel a sense of urgency after having read this article\/interview, in a good way. Since UofT&#8217;s summer break is seemingly endless, it provides an excellent opportunity to contemplate what you want to do in the future as well as what your abilities are, using the resources that the fellow UofT students have provided for us. Use the summer break wisely and make the best out of it!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Edited by the Torontonians team 日英バイリンガルや日本で就職したい海外大生が集うイベント、ボストンキャリアフォーラム、略してボスキャリまたはBCF。2018は11月9日～11月11日の三日間に渡って行われ、数々の企業が参加しました。特に3、4年生にとってはインターンシップや新卒採用をもらうのにうってつけの大イベントです。そこで、まだ行ったことが無い学生達（特に1、2年生）のために当日のスケジュールや事前準備等について昨年参加した先輩方に答えていただきました。 忙しい時期の中質問に答えて頂いたEmilyさん、Shioriさん、Avkashさん、Hinakoさん、Takumiさん、ありがとうございました！ For those who are English-Japanese bilinguals or are searching for a job in Japan, Boston Career Forum (BCF) is the event for you, especially 3rd and 4th year students who are seeking for internships or full-time offers. Last year&#8217;s event ran from November 9th [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2313,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"nf_dc_page":"","_bbp_topic_count":0,"_bbp_reply_count":0,"_bbp_total_topic_count":0,"_bbp_total_reply_count":0,"_bbp_voice_count":0,"_bbp_anonymous_reply_count":0,"_bbp_topic_count_hidden":0,"_bbp_reply_count_hidden":0,"_bbp_forum_subforum_count":0,"om_disable_all_campaigns":false,"jetpack_post_was_ever_published":false,"jetpack_publicize_message":"","jetpack_is_tweetstorm":false,"jetpack_publicize_feature_enabled":true},"categories":[27],"tags":[],"jetpack_publicize_connections":[],"jetpack_featured_media_url":"https:\/\/i0.wp.com\/uoftjn.com\/wp-content\/uploads\/2018\/12\/top.png?fit=1024%2C380&ssl=1","jetpack_sharing_enabled":true,"jetpack_shortlink":"https:\/\/wp.me\/p9x8L8-Jz","_links":{"self":[{"href":"https:\/\/uoftjn.com\/wp-json\/wp\/v2\/posts\/2825"}],"collection":[{"href":"https:\/\/uoftjn.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/uoftjn.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/uoftjn.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/uoftjn.com\/wp-json\/wp\/v2\/comments?post=2825"}],"version-history":[{"count":8,"href":"https:\/\/uoftjn.com\/wp-json\/wp\/v2\/posts\/2825\/revisions"}],"predecessor-version":[{"id":3101,"href":"https:\/\/uoftjn.com\/wp-json\/wp\/v2\/posts\/2825\/revisions\/3101"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/uoftjn.com\/wp-json\/wp\/v2\/media\/2313"}],"wp:attachment":[{"href":"https:\/\/uoftjn.com\/wp-json\/wp\/v2\/media?parent=2825"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/uoftjn.com\/wp-json\/wp\/v2\/categories?post=2825"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/uoftjn.com\/wp-json\/wp\/v2\/tags?post=2825"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}